"""
1)Создать словарь, где ключами будут числа от 1 до 5, а значениями будут их кубы.
"""

# my_dict = {k: k*2 for k in range(1, 6)}
# print(my_dict)

"""
2) Создать список из первых букв каждого слова в строке word = “Hello how are you”
"""
words = 'Hello how are you'

# d = {}
# for i in range(len(word)):
#     d = zip(i, word[i])
# print(d)

# c = [word[0] for word in words.split()]
# print(c)

"""
3)Создать список длин слов в строке, 
пропуская пустые слова.sentence = "Hello i am good and you , so what is your name"
"""
# sentence = "Hello i am good and you , so what is your name"
# word_num = [len(i) for i in sentence.split() if i != ',']
# print(word_num)
# print(sentence)
# for i in sentence:
#     print(i)

