"""
1)Задача: Вывести все числа от 10 до 1 в обратном порядке используя цикл while.
"""
# num = 10
# while num >=1:
#     print(num)
#     num -= 1
    
"""
2) Вывести таблицу умножения на 5 от 1 до 10 используя цикл for.
"""
# for i in [1,2,3,4,5,6,7,8,9,10]:
#     print(f'{i}x5 = {i*5}')

"""
3)Напишите программу, которая суммирует все числа от 1 до 10 с использованием цикла for.
"""
# res = 0
# for i in [1,2,3,4,5,6,7,8,9,10]:
#     res += i
# print(res)


"""
4)Напишите программу, которая запрашивает у пользователя 5 чисел и 
выводит их сумму с использованием цикла while.
"""
# a = 0
# b = 0
# while a != 5:
#     some = int(input('Enter: '))
#     b += some
#     a += 1
# print('Сумма: ',b)
    
    

"""
5)Напишите программу, которая запрашивает у пользователя числа, 
пока он не введет число 0, и выводит их сумму, используя цикл while.
"""

# a = True
# b = 0
# while a:
#     some = int(input("Enter: "))
#     if some == 0:
#         a = False
#     else:
#         b += some
# print('Сумма: ', b)

# Same

# num = int(input('Enter num: '))
# sum = 0

# while num != 0:
#     num = int(input('Enter num: '))
#     sum += num

# print(sum)