"""
1)Напишите программу, которая запрашивает у пользователя ввод текста 
и сохраняет его в файл "text.txt". После записи файла программа д
олжна вывести сообщение "Текст успешно записан в файл".
"""

# words = input('Enter word: ')

# with open("zadania/word_text", 'w') as file:
#     result = file.write(words)


"""
2)Создайте файл "text.txt" и запишите в него произвольный текст. 
Напишите программу, которая открывает файл "text.txt", считывает 
содержимое и подсчитывает количество слов в тексте. Выведите результат на экран.
"""

# with open('zadania/text.txt', 'r') as file:
#     result = file.read()

# print(len(result))

"""
3)Создайте файл "texxt.txt" и запишите в него произвольный текст. 
Напишите программу, которая открывает файл "text.txt", 
считывает содержимое и подсчитывает количество символов (без учета пробелов). 
Выведите результат на экран.
"""

# with open("zadania/texxt.txt", 'r') as file:
#     result = file.read()
#     no_tab = result.replace(' ', '')

# print(len(no_tab))

"""
4))Создайте файл "texts.txt" и запишите в него произвольный текст. 
Напишите программу, которая открывает файл "texts.txt", 
считывает содержимое и находит нужное слово в файле.
"""
# word = input('Enter word: ')

# with open('zadania/texts.txt', 'r') as file:
#     txt = file.read()
#     if word in txt.split():
#         print("Есть такое слово")
#     else:
#         print('Нет такого слова!')

